{
    "config": {
      "default": "en"
    },
    "language": {
      "en": {
        "#about": "about",
        "#projects": "projects",
        "#experiences": "experiences",
        "#contact": "contact",
        "#title1": "Hi, I'm Pedro Barbosa",
        "#title2": "FullStack Web Developer",
        "#subtitle": "I’m a full time learner and addicted to<br>the growth mentality.<bR>I built this portfolio from scratch,<br>hope you like it.",
        "#section2-title": "About me",
        "#learning": "Learning:",
        "#short": "Short",
        "#long": "Long",
        "#aboutme": "When I was a child, I loved playing with my computer. In 2018, i entered in college and discovered my love for coding.<br>On december, 2022 I completed my Bachelor's degree of Information Systems and was already working as a developer.<br>As a web developer, I enjoy building new stuff and exploring different roles or technologies. My goal is to learn new things and improve what I already know, always challenging myself and tracing new objectives.",
        "#myprojects": "My Projects",
        "#project1": "Machine Management",
        "#aboutproject1": "A CRUD system for the Volta Redonda Data Processing Company, where you can register all the computers under repair in the Technical Support sector",
        ".btn-view": "View",
        "#myjourney": "My journey as a fullstack web developer",
        "#jobexperiences": "Job",
        "#jobexperiences2": "Experiences",
        "#job1": "Development Internship",
        "#job2": "Junior Web Developer",
        "#job3": "Junior Web Developer",
        "#aboutjob1": "Planning, maintenance, training and development of systems<br>created for use by the different sectors of Volta Redonda city prefecture,<br>configuration of systems on servers, answering demands opened<br>by users.",
        "#aboutjob2": "Advice, planning, development and maintenance of the systems of the city prefecture of<br>Volta Redonda, meeting internal and external demands to the sector.<br>Creation of APIs and support in the use of the systems<br>by the public servants of the city hall.",
        "#aboutjob3": "System maintenance and development in Wordpress, fulfillment of<br>internal demands and direct user support. Planning, development<br>and maintenance of projects in Laravel, consuming federal government<br>APIs, updating, automating and optimizing all services offered by<br>the company. Development guided by a project manager with agile methodologies<br>and interface designed by designers. Creation of pages andportals for<br>large companies. Creation of dashboards (data extraction, transformation and loading)<br>using the Power BI tool for business analysis of contracting companies.<br>Development of automated tests using Selenium to<br>ensure the quality of project flows.",
        "#textdays": "That means that I currently have",
        "#textdays2": "days as a developer.",
        "#chat": "It’s nice to meet you.<br>Let’s have a chat",
        "#email": "pedrohugovm@gmail.com",
        "#quote": "“The happiness of your life depends upon the quality of your thoughts.”",
        "#quoteby": "~Marcus Aurelius"
      },
      "br": {
        "#about": "sobre",
        "#projects": "projetos",
        "#experiences": "experiências",
        "#contact": "contato",
        "#title1": "Olá, meu nome é Pedro Barbosa",
        "#title2": "Desenvolvedor Web FullStack",
        "#subtitle": "Eu sou um eterno aprendiz e sou viciado<br>na mentalidade de crescimento.<br>Construí este portfólio do zero,<br>espero que você goste.",
        "#section2-title": "Sobre",
        "#learning": "Aprendendo:",
        "#short": "Curta",
        "#long": "Longa",
        "#aboutme": "Na minha infância, eu amava brincar no computador. Em 2018, finalmente entrei na faculdade e descobri minha paixão por programação.<br>Em dezembro de 2022 completei meu bacharelado em Sistemas de Informação.<br>Como um desenvolvedor web, gosto de criar novas soluções e explorar diferentes funções ou tecnologias. Meu objetivo é me manter aprendendo e melhorando o que já sei, sempre me desafiando e traçando novos objetivos.",
        "#myprojects": "Meus Projetos",
        "#project1": "Controle de Máquinas",
        "#aboutproject1": "Um sistema CRUD desenvolvido para a Empresa de Processamento de Dados de Volta Redonda, com o objetivo de registrar todos os computadores sob conserto no setor de Suporte Técnico",
        ".btn-view": "Ver",
        "#myjourney": "Minha jornada como um desenvolvedor web",
        "#jobexperiences": "Experiências",
        "#jobexperiences2": "",
        "#job1": "Estagiário de Desenvolvimento",
        "#job2": "Desenvolvedor Web Jr.",
        "#job3": "Desenvolvedor Web Jr.",
        "#aboutjob1": "Planejamento, manutenção, treinamento e desenvolvimento de sistemas<br>criados para uso dos diversos setores da prefeitura de Volta Redonda,<br>configuração de sistemas em servidores, atendimento de demandas abertas<br>pelos usuários.",
        "#aboutjob2": "Assessoria, planejamneto, desenvolvimento e manutenção dos sistemas da prefeitura de<br>Volta Redonda, atendimento de demandas internas e externas ao setor.<br>Criação de API’s e suporte na utilização dos sistemas<br>por parte dos funcionários públicos da prefeitura.",
        "#aboutjob3": "Manutenção e desenvolvimento de sistema em Wordpress, atendimento de demandas internas e suporte direto ao usuário. Planejamento, desenvolvimento e manutenção de projetos em Laravel, consumindo APIs do governo federal, atualizando, automatizando e otimizando todos os serviços oferecidos pela empresa. Desenvolvimento orientado por gestor de projetos com metodologias ágeis e interface desenhada por designers. Criação de páginas e portais para empresas de grande porte. Criação de dashboards (extração, transformação e carregamento de dados) utilizando a ferramenta Power BI para análise de negócios das empresas contratantes. Desenvolvimento de testes automatizados utilizando o Selenium para garantir a qualidade dos fluxos dos projetos.",
        "#textdays": "Isso significa que tenho atualmente ",
        "#textdays2": " dias como um desenvolvedor.",
        "#chat": "Prazer em te conhecer.<br>Vamos conversar",
        "#email": "pedrohugovm@gmail.com",
        "#quote": "“A felicidade da vida depende da qualidade de nossos pensamentos.”",
        "#quoteby": "~Marco Aurélio"
      }
    }
  }